Revit 2026 API

# LevelAssociationDataSetAssociatedLevel Method

---

Sets the Associated Level.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAssociatedLevel(
	ElementId levelId
)
```
```vb
Public Sub SetAssociatedLevel (
	levelId As ElementId
)
```
```cpp
public:
void SetAssociatedLevel(
	ElementId^ levelId
)
```
```fsharp
member SetAssociatedLevel :
        levelId : ElementId -> unit
```

#### Parameters

levelId ElementId
     The id of the Level.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | this operation failed. |

#### Reference

LevelAssociationData Class

Autodesk.Revit.DB Namespace